# PinnedObjectSomeDeleted Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..PinnedObjectSomeDeleted Property
BuiltInFailures..::..EditingFailures Class See Also
---
Some pinned objects were deleted while others were not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PinnedObjectSomeDeleted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PinnedObjectSomeDeleted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PinnedObjectSomeDeleted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace